CALENDAR_CALLBACK = "CALENDAR"

start_message = "Добрый день, {0.first_name}! Я здесь, чтобы ответить на все твои вопросы и помочь тебе записаться на фотосъемку!"
comeback_message = "С возвращением, {0.first_name}!"

contact_with_the_photographer = "Связь с фотографом"
work_examples = "Примеры работ"
enroll = "Записаться"
types_of_photography = "Виды фотосьемок"
advice = "Советы"
to_menu = "В меню"
more = "Подробнее"

name_question = "Помимо Вашего имени в телеграме, я могу еще как-то к вам обращаться?"
name_is_correct = 'В моем профиле указано верное имя'
calendar_message = "Пожалуйста, выберите дату: "
date_is_already_exists = "Вы уже записаны. Если это не так, свяжитесь с фотографом."
time_question = "Пожалуйста, выберите время: "
enroll_sucsess = "Вы успешно запсались. Ожидайте сообщения от фотографа о подтверждении записи."

calendar_response_message = "Вы выбрали %s"

uslugi_message = "Портретная фотосъемка - 1200₽\n" \
                 "Семейный фотосет - 2000₽\n" \
                 "Cъемки домашних питомцев - 1500₽ \n" \
                 "Съемки классов (без услуг верстки и фотопечати) - цена зависит от локации, количества и объема работы. Напишите фотографу!\n" \
                 "Профессиональная ретушь фотографий - 400₽"

portrait = "Портретная фотосъемка"
family_photoset = "Семейный фотосет"
pets_photoset = "Cъемки домашних питомцев"
grade_photoset = "Съемки классов"
retouch = "Профессиональная ретушь фотографий"

examples_question = "Какие сделанные работы Вы хотите оценить?"

advice1 = "Ставим цель съемки"
advice2 = "Подбор референсов"
advice3 = "Образы и одежда"
advice4 = "Что взять с собой на съемку?"
advice5 = "Макияж"
advice6 = "Для мужчин"
advice7 = "Общие советы"
osobennosti_message = "Особенности: "

advice1_text = "Какая бы фотосессия у вас не была, у нее есть определенная цель, задача, которую она решает. Если вы четко сформулируете эту цель – вы получите понимание того, что нужно делать во время съемки. Иногда главную, глобальную цель нужно декомпозировать на мелкие конкретные задачи. Приведу несколько примеров: \n" \
               "A. Цель: создать идеальное резюме максимально быстро. Для него нужна одна хорошая фотография, вертикальной ориентации, поясной портрет с легкой, располагающей к себе улыбкой. Фотография нужна завтра.\n" \
               "B. Цель: получить хорошие семейные фотографии для социальных сетей и семейного архива. Должно получиться не менее 30 хороших снимков. Фотографии должны передавать искренние эмоции, быть не постановочными.\n" \
               "C. Цель: запечатлеть свой совместный визит в Санкт-Петербург. На фотографиях должны быть видны все основные городские достопримечательности и счастливые мы.\n" \
               "Проговорите свою цель фотографу, а он (то есть я), исходя из нее, посоветует вам наиболее подходящие условия для реализации – сколько нужно времени, где и когда лучше делать фото.\n"

advice2_text = "В вашем сознании, вероятно, уже сложилась четкая картинка, вы практически видите перед собой будущие фотографии. Но описать то, что вы себе представляете, словами – сложная задача. Фотографу будет намного проще, если вы покажете ему примеры, похожие фотографии, которые сейчас очень легко можно найти в интернете и сохранить на телефон." \
               "Это очень важный момент! Не пренебрегайте им! \n" \
               "Даже если вы забыли про это – уделите 5-10 минут перед самой съемкой, или даже во время нее. Поверьте, это сильно улучшит результат съемки. \n" \
               "Помимо помощи фотографу, референсы помогут и вам самим – вы найдете удачные позы или идеи, пока будете подбирать похожие фото. Также, эти фото можно показать визажисту\стилисту, если вы будете пользоваться их услугами перед съемкой.\n"

advice3_text = "За часовую съемку обычно можно успеть переодеться три раза. Заранее подберите одежду и аксессуары для каждого образа, убедитесь, что ничего не выбивается из него, и все вещи гармонично смотрятся вместе. Проведите примерку. Проверьте, что одежда не мятая и без пятен.\n" \
               "Для девушек очень рекомендованы высокие каблуки – даже если они сами не попадают в кадр, они сильно улучшают осанку.\n" \
               "Если будет ню-фотосессия – не надевайте тугих вещей, следы от лямок и резинок проходят очень долго.\n"

advice4_text = "Безусловно, для каждой фотосессии будет свой набор того, что нужно взять с собой. Но я накидаю коротенький чек-лист, который, возможно, вам поможет. Тут, конечно, все в куче, для разных жанров и для разных людей нужны разные пункты, но все же:\n\n" \
               "Расческа, косметичка, зеркальце \n" \
               "Очки (солнечные и обычные), зонтик, головные уборы, шарфики\n" \
               "Аксессуары вашей профессии (если съемка для бизнеса).\n" \
               "Аксессуары вашего хобби\n" \
               "Для деловых фотосессий – ноутбук, планшет, ежедневник\n" \
               "Еда и напитки: кофе, мороженое, сахарная вата, большие леденцы\n" \
               "Живые цветы\n" \
               "Любимые питомцы\n" \
               "Наборы для пикника (особенно актуально для lovestory на природе)\n" \
               "Разные часы, украшения\n"

advice5_text = "Тут есть два основных варианта – самостоятельный макияж, или у специалиста. Второй, конечно, сильно предпочтительней, потому что макияж для фотосессии и повседневный макияж – две большие разницы. Основная особенность макияжа для фотосессий – он более сильный, чем обычный, и сильно более матовый. В мощном студийном свете ваше лицо будет блестеть практически в любом случае, поэтому нужно активно использовать пудру и тональный крем.\n" \
               "Не бойтесь слишком сильного макияжа – на фото он будет выглядеть нормально. Профессиональные визажисты обычно знают все эти особенности, но лучше проговорить и объяснить, к чему именно вы готовитесь.\n" \
               "Имеет значение, где будет фотосессия – в студии или на улице. Для уличной съемки повседневный макияж вполне может подойти."

advice6_text = "Для мужчин макияж тоже делается, хотя, конечно, на порядки реже, скорее, в исключительных случаях. Для них гораздо важнее будет посетить барбершоп перед съемкой, сделать профессиональную дорогую стрижку с укладкой и оформление бороды или щетины.\n" \
               "Важно: не надо бриться менее, чем за день до съемки. Легкая щетина намного предпочтительней, чем выбритое до синевы лицо, но с порезами и раздражением. Лучше всего, как я написал выше, сделать оформление в хорошей мужской парикмахерской.\n"

advice7_text = "Перед фотосессией нужно хорошо выспаться. Нет смысла приходить на нее уставшим и разбитым, результат будет таким же. Также, перед съемкой не нужно обильно праздновать – на следующий день лицо будет отекшим.\n" \
               "Не опаздывайте. Если будем фотографировать второпях – результат будет хуже.\n" \
               "Не нервничайте, постарайтесь расслабиться, быть собой. Поговорите с фотографом на отвлеченные темы. Нормальное явление, когда лучшие кадры получаются к концу фотосессии, когда модель сбрасывает напряжение и становится собой.\n"
link_tg_message = 'Написать фотографу в Telegram'
link_vk_message = 'Написать фотографу в VK'

link_vk = 'https://vk.com/okko2_of'
link_tg = 'https://t.me/okkonim'

back_message = "Хотите вернуться в меню выбора?"

not_responsed_message = "Бот не распознал вашу команду. Вы уверены, что все верно?"

sovet_message1 = "11111"
sovet_message2 = "11111"
advice_message_main = " Вот полезные статьи на важные темы: "
